//Задача: Наисать программу, которая из имеющегося массива строк формирует
// массив из строк. длинна котрых меньше либоравна 3символа. Первоначальный
// массивможноввести с клавиатуры, либо задать на старте выполнеия алгоритма. 
//При решении не рекомендуется пользоваться коллекциями, 
//лучше обойтись исключительно массивами.




Console.WriteLine("Hello, World!");
